<?php
// __сall використовується для звернення до неіснуючих методів класу.
//1. Для розуміння спочатку простий приклад.
class Some
{
    public function __call($name, $arguments)
    {
        var_dump($name, $arguments);
    }

}
$test = new Some();
$test->something('argument', 'method', 'foo', 'example' ); //метода something - реально не існує, я його не вказував у вкласі
//магія для мене, те що ми не задаємо змінну $name Вона пререходить від назви методу something, автоматично
//так як і що параметри передаються у виді массиву і скільки я би не добавляв все буде ок


